{
  "_name_or_path": "/Users/anuragch/Desktop/Ad 4-2 2/models/bert/saved_model",
  "architectures": [
    "RobertaForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "eos_token_id": 2,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "malware",
    "1": "phishing",
    "2": "ransomware",
    "3": "ddos",
    "4": "data_breach"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "data_breach": 4,
    "ddos": 3,
    "malware": 0,
    "phishing": 1,
    "ransomware": 2
  },
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 514,
  "model_type": "roberta",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 1,
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "torch_dtype": "float32",
  "transformers_version": "4.48.3",
  "type_vocab_size": 1,
  "use_cache": true,
  "vocab_size": 50265
}
